Revit 2026 API

# StructuralConnectionTypeSetFamilySymbolId Method

---

FamilySymbol of the annotation to use for this connection type.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFamilySymbolId(
	ElementId familySymbolId
)
```
```vb
Public Sub SetFamilySymbolId (
	familySymbolId As ElementId
)
```
```cpp
public:
void SetFamilySymbolId(
	ElementId^ familySymbolId
)
```
```fsharp
member SetFamilySymbolId :
        familySymbolId : ElementId -> unit
```

#### Parameters

familySymbolId ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when familySymbolId is the id of some element that is not a FamilySymbol, is not of the category "Connection Symbols" (OST_StructConnectionSymbols), or has its "Apply To" parameter not equal to this type's applyTo property. |
| ArgumentNullException | A non-optional argument was null |

The FamilySymbol must be of category "Connection Symbols" (OST_StructConnectionSymbols) and have its "Apply To" parameter set to match the applyTo property.

#### Reference

StructuralConnectionType Class

Autodesk.Revit.DB.Structure Namespace